<h1>Pandas Tutorial: Preparing Measles data ready for plotting</h1>

Before you can make pretty plots like that demonstrated in the main notebook of this project, you need to get the data into a state in which it can be easily explored and manipulated. A tool in the Python arsenal that is great for this job is Pandas. This is a library that is used heavily within the world of Data Science and was designed in an effort to make Python more usable for data analysis and modelling. It shares many simularties in workflow seen in the R programming language and more specifically the TidyVerse packages.

In this notebook you will find boilerplate code that will help guide you through all the steps I took in the notebook "Exploring Measles with interactive plots" for data wrangling - this term, 'wrangling', is what data scientists call the process of transforming data into a format more suitable for the analytical process. 

Lets start by importing Pandas

In [8]:
#We import the pandas library under the alias 'pd'
import pandas as pd
import random

With Pandas loaded into the script, you then want to import the data. Pandas has <a href="https://pandas.pydata.org/pandas-docs/stable/io.html">multiple methods for importing data.</a> We are going to use the `read_csv` method to read in the csv file that contains the measles data, aptly called 'measles.csv'. You need to pass this method the name of the file as a string.

In [2]:
data = pd.read_csv("insert csv file name here")

The `read_csv` method retrieves the data and builds a Pandas DataFrame that we are storing here in the variable `data`.

<h2>DataFrames</h2>

At the center of Pandas is the Pandas DataFrame object. This is a two dimenstional tablular object with labelled axis, rows and columns; think of it as a bit like a table in an Excel document. Once our data is contained within a DataFrame object, we can take advantage of the various attributes and methods associated with this class. As an example of such methods and attributes, see the calls below:

* `head` method displays the first few rows of a DataFrame (you can specify the number of rows by specifying 'n')
* `describe` method provides some summary information for each column of the DataFrame
* `shape` attribute provides a tuple detailing the number of rows and columns in the DataFrame

There are many more methods and attributes that can be accessed within a Pandas DataFrame, and you can read more about them in the <a href="https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html">documentation.</a>

In [4]:
data.head(n = "Insert the number of rows you wish to see as an integer here")

     week state   state_name  disease  cases  incidence_per_capita
0  192801    AL      ALABAMA  MEASLES     97                  3.67
1  192801    AR     ARKANSAS  MEASLES     76                  4.11
2  192801    AZ      ARIZONA  MEASLES      8                  1.90
3  192801    CA   CALIFORNIA  MEASLES     74                  1.38
4  192801    CO     COLORADO  MEASLES     85                  8.38
5  192801    CT  CONNECTICUT  MEASLES     71                  4.50
6  192801    DE     DELAWARE  MEASLES     20                  8.58
7  192801    FL      FLORIDA  MEASLES      3                  0.21
8  192801    GA      GEORGIA  MEASLES     34                  1.17
9  192801    IA         IOWA  MEASLES      4                  0.16

In [5]:
data.describe()

                week          cases  incidence_per_capita
count  145167.000000  145167.000000         145167.000000
mean   196012.188417     128.617372              4.445870
std      1918.861491     392.418360             11.053309
min    192801.000000       0.000000              0.000000
25%    194410.000000       1.000000              0.030000
50%    195937.000000      11.000000              0.530000
75%    197451.000000      73.000000              3.510000
max    200252.000000   10402.000000            683.060000

In [6]:
data.shape

(145167, 6)

<h2>Fixing the time variable</h2>

The first thing I did in the main notebook is split the week column into two new columns, year and week number. The first four digits of each row in the week column is the year and the last two digits is the week number. We can convert the values in this column to a string format and then use string indexing to extract the year and week number.

Complete the examples below:

In [ ]:
example_week = "192801"
year = example_week["Use string indexing to select the first four elements"]
week_number = example_week["Use string indexing to select the last two elements"]

We're going to use two different methods for creating the year column and the week column, first with a `for` loop and then with a more efficient functional method.

It is possible to loop over the rows of a Pandas DataFrame using the `iterrows` method, this returns the index and the row object. In the code section below is a `for` loop that accesses each row of the data object. For each row in the DataFrame, convert the value of the week column to a string and then append the year to the `year` list and the week number to the `week_num` list.

You can access a column such as the week column as so: `row["week"]`, supply the column name as a string in square brackets.

In [ ]:
year = []
week_num = []
for i, row in data.iterrows():
    week = str("Access the week column here to convert its value to a string")
    #Convert back to an integer by passing the value to int()
    year.append(int(week["Select the year"]))
    week_num.append(int(week["Select the week number"]))

In [ ]:
#DON'T CHANGE ANYTHING HERE
#Run the code here to test your code
random_i = [random.randint(0, len(data)) for x in range(5)] 
for x in random_i:
    print("---------------------")
    print("Week value for data at index {}: {}".format(x, data.loc[x]["week"]))
    print("Extracted year value: {}".format(year[x]))
    print("Extracted week number value: {}".format(week_num[x]))
    print("---------------------")

Loops are messy and often less efficient than applying a function call, and for this reason you should avoid them. You should try to use the apply method instead.

<h3>Apply method and lambda functions</h3>

The `apply` method of the Pandas DataFrame object allows you apply a function across one of the axis of the DataFrame. The apply method can also be applied to a specific column, but first we need to talk about **Series**. Each column of a Pandas DataFrame is represented by a Series object, which has similar methods and attributes as the parent dataframe, but applied to that specific column. You can read more about Series <a href="https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.html">here.</a>

You pass the apply method a function. This can be a predefined function like in the example below:

In [25]:
example_data = pd.DataFrame({"a": [0,1,2,3,4,5], "b": [2, 4, 6, 8, 10, 12]})

def example_function(x):
    return x * 2

In [26]:
example_data["a"].apply(example_function)

0     0
1     2
2     4
3     6
4     8
5    10
Name: a, dtype: int64

In [27]:
example_data["b"].apply(example_function)

0     4
1     8
2    12
3    16
4    20
5    24
Name: b, dtype: int64

There is also a special type of function known as an anonymous function. This is defined 'on the fly' instead of the function above. We can use the in-built `lambda` function which allows us to generate one line functions like so:

`lambda x : do something with x`

We can achieve the same as the above examples with the following apply function with a lambda call

In [28]:
example_data["a"].apply(lambda x: x*2)

0     0
1     2
2     4
3     6
4     8
5    10
Name: a, dtype: int64

In [29]:
example_data["b"].apply(lambda x: x*2)

0     4
1     8
2    12
3    16
4    20
5    24
Name: b, dtype: int64

Lets now extra the year and week number, like we did with the for loop, but now using the apply method and a lambda function. I want you to complete the apply calls below, but as a hint, for an argument `x` we want to perform the operation `int(str(x)[0:4])` to extract the first four elements of a value (the year) and return it as an integer.

Save the data back into the DataFrame by refering to a new column:

In [ ]:
data["year"] = data["week"].apply("INSERT LAMBDA FUNCTION HERE")
data["week_num"] = data["week"].apply("INSERT LAMBDA FUNCTION HERE")

In [ ]:
data.head()

With the new columns created, we can remove the original week column by using the `drop` method. Consult the <a href="https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.drop.html">documentation</a> here and see if you can work out how to use the `drop` method, and use it to remove the original week column.

In [30]:
#Insert your call to the drop method here

In [ ]:
data.head()

<h2>Grouping and summarising</h2>

Excellent! We now have a DataFrame that contains the seperated year and week number data. To finish off, lets create a `summarise` function similar to that which I used in "Exploring Measles with interactive plots" notebook. This function will take a DataFrame object, a list of columns to group the data by, and will return a new DataFrame object with the total number of cases for each group.

This function will exploit a few powerful features of the Pandas library. To gain some intuition lets walk through this step by step, by grouping our data by state name, calualte the total number of cases, and then convert the results back into a DataFrame.

In [31]:
grouped_by_state = data.groupby(by = "state_name")

`grouped_by_state` is a GroupBy object, an object in Pandas that allows us to apply methods in a grouped context. For example, the code below uses the `sum` method on the Series 'cases' which adds together the number of cases for each group, where each group is a unique state. This is an incredibly powerful concept in Pandas and allows you to group on multiple conditions and then create summaries of your data.

In [35]:
total_cases_by_state = grouped_by_state["cases"].sum()

In [37]:
total_cases_by_state.head(5)

state_name
ALABAMA        209582
ALASKA          16908
ARIZONA        160810
ARKANSAS       134250
CALIFORNIA    1376847
Name: cases, dtype: int64

See above how we have grouped by state name and calculated the total number of cases for each unique state.

In [40]:
total_cases_by_state = pd.DataFrame(total_cases_by_state).reset_index()

In [41]:
total_cases_by_state.head()

   state_name    cases
0     ALABAMA   209582
1      ALASKA    16908
2     ARIZONA   160810
3    ARKANSAS   134250
4  CALIFORNIA  1376847

In [42]:
total_cases_by_state = total_cases_by_state.rename(columns = {"cases": "Total_Cases"})

In [43]:
total_cases_by_state.head()

   state_name  Total_Cases
0     ALABAMA       209582
1      ALASKA        16908
2     ARIZONA       160810
3    ARKANSAS       134250
4  CALIFORNIA      1376847

In [ ]:
def summarise(df, group_by):
    #Group the data using the argument 'group_by' and save the result into a variable called 'grouped'
    grouped =
    #Calulate the total number of cases and save the result into the variable 'total_cases'
    total_cases =
    #Convert total cases into a pandas dataframe object, use reset index to move the group index to a column
    new_df =
    #Rename the columns in new_df
    new_df = new_df.rename("INSERT MAPPINGS")
    return new_df